tap "caskformula/caskformula"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
cask "osxfuse"
brew "asciinema" # Record and share terminal sessions
brew "aws-shell" # Integrated shell for working with the AWS CLI
brew "awscli" # Official Amazon AWS command-line interface
brew "coreutils"
brew "csvkit" # Suite of command-line tools for converting to and working with CSV
brew "docker-compose"
brew "direnv" # Load/unload environment variables based on $PWD
#brew "erlang" # Programming language for highly scalable real-time systems
#brew "elixir" # Functional metaprogramming aware language built on Erlang VM
#brew "elm" # Functional programming language for building browser-based GUIs
brew "enca" # Charset analyzer and converter
brew "fasd" # CLI tool for quick access to files and directories
brew "fdupes" # Identify or delete duplicate files
brew "ffmpeg" # Play, record, convert, and stream audio and video
brew "fzf" # Command-line fuzzy finder written in Go
brew "git" # Distributed revision control system
brew "git-flow" # Extensions to follow Vincent Driessen's branching model
brew "gnupg" # GNU Pretty Good Privacy (PGP) package
brew "go" # Open source programming language to build simple/reliable/efficient software
brew "pkg-config" # Manage compile and link flags for libraries
brew "graphicsmagick" # Image processing tools collection
brew "hcloud" # Command-line interface for Hetzner Cloud
brew "htop" # Improved top (interactive process viewer)
brew "httpie" # User-friendly cURL replacement (command-line HTTP client)
brew "hub" # Add GitHub support to git on the command-line
brew "usbmuxd", args: ["HEAD"] # USB multiplexor daemon for iPhone and iPod Touch devices
brew "libimobiledevice", args: ["HEAD"] # Library to communicate with iOS devices natively
brew "ideviceinstaller" # Cross-platform library for communicating with iOS devices
brew "imagemagick" # Tools and libraries to manipulate images in many formats
brew "ios-deploy" # Install and debug iPhone apps from the command-line
brew "jq" # Lightweight and flexible command-line JSON processor
brew "legit" # Command-line interface for Git, optimized for workflow simplicity
brew "lnav" # Curses-based tool for viewing and analyzing log files
brew "make" # Utility for directing compilation
brew "mas" # Mac App Store command-line interface
brew "mkvtoolnix" # Matroska media files manipulation tools
brew "mitmproxy"
brew "mmv" # Move, copy, append, and link multiple files
brew "nmap" # Port scanning utility for large networks
brew "pandoc" # Swiss-army knife of markup format conversion
brew "php" # General-purpose scripting language
brew "pv" # Monitor data's progress through a pipe
brew "rclone" # Rsync for cloud storage
brew "ruby", link: true # Powerful, clean, object-oriented scripting language
#brew "rust" # moved to rustup
brew "ssh-copy-id" # Add a public key to a remote machine's authorized_keys file
brew "telnet" # User interface to the TELNET protocol (built from macOS Sierra sources)
brew "terminal-notifier"
brew "tldr" # Simplified and community-driven man pages
brew "tmux"
brew "unrar" # Extract, view, and test RAR archives
brew "watchman" # Watch files and take action when they change
brew "wget" # Internet file retriever
brew "wrk" # HTTP benchmarking tool
# brew "yarn" # JavaScript package manager
brew "youtube-dl" # Download YouTube videos from the command-line
brew "zsh" # UNIX shell (command interpreter)
brew "Schniz/tap/fnm" # Fast Node Manager

cask "1password"
cask "aerial"
cask "alfred"
#cask "appcleaner"
cask "atext"
cask "balenaetcher"
# cask "blender"
# cask "calibre"
cask "coconutbattery"
#cask "cyberduck"
cask "dash3"
cask "dnscrypt-proxy"
cask "docker"
cask "dropbox"
cask "firefoxdeveloperedition"
cask "font-dosis"
cask "font-fira-code"
cask "font-source-code-pro"
cask "gpg-suite"
cask "handbrake"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "kaleidoscope"
cask "keepassxc"
#cask "licecap"
cask "mkvtools"
cask "mockoon"
cask "mono-mdk"
cask "monolingual"
cask "ngrok"
#cask "numi"
cask "paragon-ntfs"
cask "paw"
cask "quicklook-json"
cask "signal"
cask "skitch"
cask "skype"
#cask "smcfancontrol"
cask "sourcetree"
cask "speedify"
cask "spotify"
cask "sublime-text"
cask "suspicious-package"
cask "syncthing"
cask "teamviewer"
cask "the-unarchiver"
cask "toggl"
#cask "tor-browser"
cask "transmission"
cask "tunnelbear"
#cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "wireshark"
#cask "xrg"

# App Store apps
mas "Affinity Designer", id: 824171161
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Be Focused", id: 973134470
mas "CotEditor", id: 1024640650
mas "Deliveries", id: 924726344
mas "Kindle", id: 405399194
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Telegram", id: 747648890
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835